========================
line comment with pound
========================

# hello i am a comment

------------------------

(source_file
  (comment))

============================
line comment with semicolon
============================

; hello i am also a comment

----------------------------

(source_file
  (comment))

=============================
multiline comment with pound
=============================

# this is a comment line
# followed by another
# and another

-----------------------------

(source_file
  (comment)
  (comment)
  (comment))

=================================
multiline comment with semicolon
=================================

; this is a comment line
; followed by another
; and another

---------------------------------

(source_file
  (comment)
  (comment)
  (comment))

=====================================
multiline comment with mixed symbols
=====================================

; this is a comment line
# followed by another
; and another

-------------------------------------

(source_file
  (comment)
  (comment)
  (comment))

=====================================
single transaction with some comment
=====================================

2024-4-2
  wrk            .... ; an hour of focussed work

-------------------------------------

(source_file
  (day_entry
    (date)
    (transaction
      (account)
      (quantity)
      (comment))))
