=================
date with dashes
=================

2024-4-2

-----------------

(source_file
  (day_entry
    (date)))

==================
date with slashes
==================

2024-4-2

------------------

(source_file
  (day_entry
    (date)))

===============
date with dots
===============

2024/4/2

---------------

(source_file
  (day_entry
    (date)))

==================================
multiple entries with mixed dates
==================================

2024-4-2
2024-4-2
2024/4/2

------------

(source_file
  (day_entry
    (date))
  (day_entry
    (date))
  (day_entry
    (date)))
