=================
date with dashes
=================

2024-4-2

-----------------

(source_file
  (day_entry
    (date)))

==================
date with slashes
==================

2024-4-2

------------------

(source_file
  (day_entry
    (date)))

===============
date with dots
===============

2024/4/2

---------------

(source_file
  (day_entry
    (date)))

============================
dates with mixed separators
============================

2024-4-2
2024-4-2
2024/4/2

----------------------------

(source_file
  (day_entry
    (date))
  (day_entry
    (date))
  (day_entry
    (date)))
